In [1]:
# make sure you have pandas installed
!pip install pandas

Requirement already satisfied: pandas in c:\users\hi\appdata\local\programs\python\python39\lib\site-packages (2.2.0)
Requirement already satisfied: numpy<2,>=1.22.4 in c:\users\hi\appdata\local\programs\python\python39\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\hi\appdata\local\programs\python\python39\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\hi\appdata\local\programs\python\python39\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\hi\appdata\local\programs\python\python39\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\hi\appdata\local\programs\python\python39\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

WARNING: Ignoring invalid distribution -eras (c:\users\hi\appdata\local\programs\python\python39\lib\site-packages)
WARNING: Ignoring invalid distribution -eras (c:\users\hi\appdata\local\programs\python\python39\lib\site-packages)
WARNING: Ignoring invalid distribution -eras (c:\users\hi\appdata\local\programs\python\python39\lib\site-packages)

[notice] A new release of pip is available: 24.2 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
import pandas as pd

import warnings
warnings.filterwarnings(action='ignore')

# print(pd.__version__)
data_file = 'data.csv' # NOTE: make sure you have this file

In [ ]:
# use following so that all data gets displayed in one line
pd.set_option("display.expand_frame_repr", False)
# also optional: widen display so columns donâ€™t get truncated
pd.set_option("display.max_columns", None)
pd.set_option("display.width", 1000)

In [4]:
# access columns
data_file = 'data.csv'
df = pd.read_csv(data_file)
print(df)
print("###########################")

# I want to print column names
names_of_col = df.columns.tolist()
print(names_of_col)

       Name  Age         City  Exp  Exp2   Salary passport  bonus  hours
0     Alice   25      Chicago    2     2  70000.0      a43   1000    100
1       Bob   30  Los Angeles    5     5  80000.0      a44   3000    150
2   Charlie   35      Chicago    7     7      NaN      a45      0    200
3     David   40      Houston   10    10  90000.0      a46   7000    100
4       Eva   22      Houston    1     1  48000.0      a47   2555    120
5     Frank   28          NaN    3     3  72000.0      a48      0    100
6     Grace   32  San Antonio    6     6  85000.0      a49      0    200
7     Helen   26    San Diego    2     2  62000.0      a50   9000    100
8     Helen   26    San Diego    2     2  62000.0      a51      0     80
9     Helen   26    San Diego    2     2  62000.0      a52   3000    100
10    Jerry   23      Phoenix    6     6  78000.0      a53      0     80
###########################
['Name', 'Age', 'City', 'Exp', 'Exp2', 'Salary', 'passport', 'bonus', 'hours']

In [8]:
# access data for 1 column: Age

df = pd.read_csv(data_file)
print(df)
print("###########################")


age = df['Age']
# age = df.Age # or use this

print(age)
print(type(age)) # <class 'pandas.core.series.Series'>

       Name  Age         City  Exp  Exp2   Salary passport  bonus  hours
0     Alice   25      Chicago    2     2  70000.0      a43   1000    100
1       Bob   30  Los Angeles    5     5  80000.0      a44   3000    150
2   Charlie   35      Chicago    7     7      NaN      a45      0    200
3     David   40      Houston   10    10  90000.0      a46   7000    100
4       Eva   22      Houston    1     1  48000.0      a47   2555    120
5     Frank   28          NaN    3     3  72000.0      a48      0    100
6     Grace   32  San Antonio    6     6  85000.0      a49      0    200
7     Helen   26    San Diego    2     2  62000.0      a50   9000    100
8     Helen   26    San Diego    2     2  62000.0      a51      0     80
9     Helen   26    San Diego    2     2  62000.0      a52   3000    100
10    Jerry   23      Phoenix    6     6  78000.0      a53      0     80
###########################
0     25
1     30
2     35
3     40
4     22
5     28
6     32
7     26
8     26
9     26
10    23
Name: Age, dtype: int64
<class 'pandas.core.series.Series'>

In [9]:
# I want to access dataframe for 2 columns: 'Name', 'City'
print(df)
print("####################")

df_temp = df[['Name', 'City']]
print(df_temp)

       Name  Age         City  Exp  Exp2   Salary passport  bonus  hours
0     Alice   25      Chicago    2     2  70000.0      a43   1000    100
1       Bob   30  Los Angeles    5     5  80000.0      a44   3000    150
2   Charlie   35      Chicago    7     7      NaN      a45      0    200
3     David   40      Houston   10    10  90000.0      a46   7000    100
4       Eva   22      Houston    1     1  48000.0      a47   2555    120
5     Frank   28          NaN    3     3  72000.0      a48      0    100
6     Grace   32  San Antonio    6     6  85000.0      a49      0    200
7     Helen   26    San Diego    2     2  62000.0      a50   9000    100
8     Helen   26    San Diego    2     2  62000.0      a51      0     80
9     Helen   26    San Diego    2     2  62000.0      a52   3000    100
10    Jerry   23      Phoenix    6     6  78000.0      a53      0     80
####################
       Name         City
0     Alice      Chicago
1       Bob  Los Angeles
2   Charlie      Chicago
3     David      Houston
4       Eva      Houston
5     Frank          NaN
6     Grace  San Antonio
7     Helen    San Diego
8     Helen    San Diego
9     Helen    San Diego
10    Jerry      Phoenix

In [10]:
# Now lets add a row
df = pd.read_csv('data.csv')
print(df)

print("####################")
# add a row
# df.loc[len(df)] = ['Kim', 29, 'Tokyo', 4, 4, 67000.0, 'm33'] # INCOREECT because the number of records do not match
df.loc[len(df)] = ['Kim', 29, 'Tokyo', 4, 4, 67000.0, 'm33', 0, 90]
print(df)

       Name  Age         City  Exp  Exp2   Salary passport  bonus  hours
0     Alice   25      Chicago    2     2  70000.0      a43   1000    100
1       Bob   30  Los Angeles    5     5  80000.0      a44   3000    150
2   Charlie   35      Chicago    7     7      NaN      a45      0    200
3     David   40      Houston   10    10  90000.0      a46   7000    100
4       Eva   22      Houston    1     1  48000.0      a47   2555    120
5     Frank   28          NaN    3     3  72000.0      a48      0    100
6     Grace   32  San Antonio    6     6  85000.0      a49      0    200
7     Helen   26    San Diego    2     2  62000.0      a50   9000    100
8     Helen   26    San Diego    2     2  62000.0      a51      0     80
9     Helen   26    San Diego    2     2  62000.0      a52   3000    100
10    Jerry   23      Phoenix    6     6  78000.0      a53      0     80
####################
       Name  Age         City  Exp  Exp2   Salary passport  bonus  hours
0     Alice   25      Chicago    2     2  70000.0      a43   1000    100
1       Bob   30  Los Angeles    5     5  80000.0      a44   3000    150
2   Charlie   35      Chicago    7     7      NaN      a45      0    200
3     David   40      Houston   10    10  90000.0      a46   7000    100
4       Eva   22      Houston    1     1  48000.0      a47   2555    120
5     Frank   28          NaN    3     3  72000.0      a48      0    100
6     Grace   32  San Antonio    6     6  85000.0      a49      0    200
7     Helen   26    San Diego    2     2  62000.0      a50   9000    100
8     Helen   26    San Diego    2     2  62000.0      a51      0     80
9     Helen   26    San Diego    2     2  62000.0      a52   3000    100
10    Jerry   23      Phoenix    6     6  78000.0      a53      0     80
11      Kim   29        Tokyo    4     4  67000.0      m33      0     90

In [11]:
# lets drop 2 rows based on index, idx=2, 11
df = df.drop([2, 11,])
print(df)

     Name  Age         City  Exp  Exp2   Salary passport  bonus  hours
0   Alice   25      Chicago    2     2  70000.0      a43   1000    100
1     Bob   30  Los Angeles    5     5  80000.0      a44   3000    150
3   David   40      Houston   10    10  90000.0      a46   7000    100
4     Eva   22      Houston    1     1  48000.0      a47   2555    120
5   Frank   28          NaN    3     3  72000.0      a48      0    100
6   Grace   32  San Antonio    6     6  85000.0      a49      0    200
7   Helen   26    San Diego    2     2  62000.0      a50   9000    100
8   Helen   26    San Diego    2     2  62000.0      a51      0     80
9   Helen   26    San Diego    2     2  62000.0      a52   3000    100
10  Jerry   23      Phoenix    6     6  78000.0      a53      0     80

In [13]:
# use following so that all data gets displayed in one line
pd.set_option("display.expand_frame_repr", False)
# also optional: widen display so columns donâ€™t get truncated
pd.set_option("display.max_columns", None)
pd.set_option("display.width", 1000)

In [14]:
# lets create a new column 'company' with same values all across rows

df['company'] = "Lucent Shamlodhiya Technologies" 
print("\nAfter :\n",df)

After :
      Name  Age         City  Exp  Exp2   Salary passport  bonus  hours                          company
0   Alice   25      Chicago    2     2  70000.0      a43   1000    100  Lucent Shamlodhiya Technologies
1     Bob   30  Los Angeles    5     5  80000.0      a44   3000    150  Lucent Shamlodhiya Technologies
3   David   40      Houston   10    10  90000.0      a46   7000    100  Lucent Shamlodhiya Technologies
4     Eva   22      Houston    1     1  48000.0      a47   2555    120  Lucent Shamlodhiya Technologies
5   Frank   28          NaN    3     3  72000.0      a48      0    100  Lucent Shamlodhiya Technologies
6   Grace   32  San Antonio    6     6  85000.0      a49      0    200  Lucent Shamlodhiya Technologies
7   Helen   26    San Diego    2     2  62000.0      a50   9000    100  Lucent Shamlodhiya Technologies
8   Helen   26    San Diego    2     2  62000.0      a51      0     80  Lucent Shamlodhiya Technologies
9   Helen   26    San Diego    2     2  62000.0      a52   3000    100  Lucent Shamlodhiya Technologies
10  Jerry   23      Phoenix    6     6  78000.0      a53      0     80  Lucent Shamlodhiya Technologies

In [15]:
# Lets drop 2 columns that we do not need: 'company','Exp2'
print(df)
print("#####################")

df.drop(columns=['company','Exp2'], inplace=True)
print("\nAfter dropping a column:\n",df)

     Name  Age         City  Exp  Exp2   Salary passport  bonus  hours                          company
0   Alice   25      Chicago    2     2  70000.0      a43   1000    100  Lucent Shamlodhiya Technologies
1     Bob   30  Los Angeles    5     5  80000.0      a44   3000    150  Lucent Shamlodhiya Technologies
3   David   40      Houston   10    10  90000.0      a46   7000    100  Lucent Shamlodhiya Technologies
4     Eva   22      Houston    1     1  48000.0      a47   2555    120  Lucent Shamlodhiya Technologies
5   Frank   28          NaN    3     3  72000.0      a48      0    100  Lucent Shamlodhiya Technologies
6   Grace   32  San Antonio    6     6  85000.0      a49      0    200  Lucent Shamlodhiya Technologies
7   Helen   26    San Diego    2     2  62000.0      a50   9000    100  Lucent Shamlodhiya Technologies
8   Helen   26    San Diego    2     2  62000.0      a51      0     80  Lucent Shamlodhiya Technologies
9   Helen   26    San Diego    2     2  62000.0      a52   3000    100  Lucent Shamlodhiya Technologies
10  Jerry   23      Phoenix    6     6  78000.0      a53      0     80  Lucent Shamlodhiya Technologies
#####################

After dropping a column:
      Name  Age         City  Exp   Salary passport  bonus  hours
0   Alice   25      Chicago    2  70000.0      a43   1000    100
1     Bob   30  Los Angeles    5  80000.0      a44   3000    150
3   David   40      Houston   10  90000.0      a46   7000    100
4     Eva   22      Houston    1  48000.0      a47   2555    120
5   Frank   28          NaN    3  72000.0      a48      0    100
6   Grace   32  San Antonio    6  85000.0      a49      0    200
7   Helen   26    San Diego    2  62000.0      a50   9000    100
8   Helen   26    San Diego    2  62000.0      a51      0     80
9   Helen   26    San Diego    2  62000.0      a52   3000    100
10  Jerry   23      Phoenix    6  78000.0      a53      0     80

In [16]:
# lets replace values of column City
df['City'] = df['City'].replace({
    'Los Angeles': 'LA',
    'San Diego': 'SD'
})
print(df)

     Name  Age         City  Exp   Salary passport  bonus  hours
0   Alice   25      Chicago    2  70000.0      a43   1000    100
1     Bob   30           LA    5  80000.0      a44   3000    150
3   David   40      Houston   10  90000.0      a46   7000    100
4     Eva   22      Houston    1  48000.0      a47   2555    120
5   Frank   28          NaN    3  72000.0      a48      0    100
6   Grace   32  San Antonio    6  85000.0      a49      0    200
7   Helen   26           SD    2  62000.0      a50   9000    100
8   Helen   26           SD    2  62000.0      a51      0     80
9   Helen   26           SD    2  62000.0      a52   3000    100
10  Jerry   23      Phoenix    6  78000.0      a53      0     80

In [17]:
# creating a column by adding values from 2 columns: total_salary = Salary + bonus
df['total_salary'] = df['Salary'] + df['bonus']
print(df)

     Name  Age         City  Exp   Salary passport  bonus  hours  total_salary
0   Alice   25      Chicago    2  70000.0      a43   1000    100       71000.0
1     Bob   30           LA    5  80000.0      a44   3000    150       83000.0
3   David   40      Houston   10  90000.0      a46   7000    100       97000.0
4     Eva   22      Houston    1  48000.0      a47   2555    120       50555.0
5   Frank   28          NaN    3  72000.0      a48      0    100       72000.0
6   Grace   32  San Antonio    6  85000.0      a49      0    200       85000.0
7   Helen   26           SD    2  62000.0      a50   9000    100       71000.0
8   Helen   26           SD    2  62000.0      a51      0     80       62000.0
9   Helen   26           SD    2  62000.0      a52   3000    100       65000.0
10  Jerry   23      Phoenix    6  78000.0      a53      0     80       78000.0

In [18]:
# lets create a column that shows 10% tax for each person 

df['tax_10percent'] = df['total_salary'] * 0.1
print(df)

     Name  Age         City  Exp   Salary passport  bonus  hours  total_salary  tax_10percent
0   Alice   25      Chicago    2  70000.0      a43   1000    100       71000.0         7100.0
1     Bob   30           LA    5  80000.0      a44   3000    150       83000.0         8300.0
3   David   40      Houston   10  90000.0      a46   7000    100       97000.0         9700.0
4     Eva   22      Houston    1  48000.0      a47   2555    120       50555.0         5055.5
5   Frank   28          NaN    3  72000.0      a48      0    100       72000.0         7200.0
6   Grace   32  San Antonio    6  85000.0      a49      0    200       85000.0         8500.0
7   Helen   26           SD    2  62000.0      a50   9000    100       71000.0         7100.0
8   Helen   26           SD    2  62000.0      a51      0     80       62000.0         6200.0
9   Helen   26           SD    2  62000.0      a52   3000    100       65000.0         6500.0
10  Jerry   23      Phoenix    6  78000.0      a53      0     80       78000.0         7800.0

In [19]:
# lets create a column that shows total_salary + festival bonus of 1000 to each person 
df['total_salary_bonus'] = df['total_salary'] + 1000
print(df)

     Name  Age         City  Exp   Salary passport  bonus  hours  total_salary  tax_10percent  total_salary_bonus
0   Alice   25      Chicago    2  70000.0      a43   1000    100       71000.0         7100.0             72000.0
1     Bob   30           LA    5  80000.0      a44   3000    150       83000.0         8300.0             84000.0
3   David   40      Houston   10  90000.0      a46   7000    100       97000.0         9700.0             98000.0
4     Eva   22      Houston    1  48000.0      a47   2555    120       50555.0         5055.5             51555.0
5   Frank   28          NaN    3  72000.0      a48      0    100       72000.0         7200.0             73000.0
6   Grace   32  San Antonio    6  85000.0      a49      0    200       85000.0         8500.0             86000.0
7   Helen   26           SD    2  62000.0      a50   9000    100       71000.0         7100.0             72000.0
8   Helen   26           SD    2  62000.0      a51      0     80       62000.0         6200.0             63000.0
9   Helen   26           SD    2  62000.0      a52   3000    100       65000.0         6500.0             66000.0
10  Jerry   23      Phoenix    6  78000.0      a53      0     80       78000.0         7800.0             79000.0

In [20]:
# lets create a column that shows salary per hours for each  person 
df['sal_per_hr'] = df['total_salary'] / df['hours']
print(df)

     Name  Age         City  Exp   Salary passport  bonus  hours  total_salary  tax_10percent  total_salary_bonus  sal_per_hr
0   Alice   25      Chicago    2  70000.0      a43   1000    100       71000.0         7100.0             72000.0  710.000000
1     Bob   30           LA    5  80000.0      a44   3000    150       83000.0         8300.0             84000.0  553.333333
3   David   40      Houston   10  90000.0      a46   7000    100       97000.0         9700.0             98000.0  970.000000
4     Eva   22      Houston    1  48000.0      a47   2555    120       50555.0         5055.5             51555.0  421.291667
5   Frank   28          NaN    3  72000.0      a48      0    100       72000.0         7200.0             73000.0  720.000000
6   Grace   32  San Antonio    6  85000.0      a49      0    200       85000.0         8500.0             86000.0  425.000000
7   Helen   26           SD    2  62000.0      a50   9000    100       71000.0         7100.0             72000.0  710.000000
8   Helen   26           SD    2  62000.0      a51      0     80       62000.0         6200.0             63000.0  775.000000
9   Helen   26           SD    2  62000.0      a52   3000    100       65000.0         6500.0             66000.0  650.000000
10  Jerry   23      Phoenix    6  78000.0      a53      0     80       78000.0         7800.0             79000.0  975.000000